export const userInfoInputFields = [
  {
    id: "name",
    label: "নাম*",
    placeholder: "আপনার নাম",
  },
  {
    id: "phone",
    label: "ফোন নাম্বার*",
    placeholder: "আপনার ফোন নাম্বার",
  },
  {
    id: 'division',
    label: "বিভাগ*",
    placeholder: "বিভাগ সিলেক্ট করুন",
    type: "select",
    items: [
      { key: "বরিশাল", value: "বরিশাল" },
      { key: "ঢাকা", value: "ঢাকা" },
      { key: "চট্টগ্রাম", value: "চট্টগ্রাম" },
      { key: "খুলনা", value: "খুলনা" },
      { key: "রাজশাহী", value: "রাজশাহী" },
      { key: "রংপুর", value: "রংপুর" },
      { key: "সিলেট", value: "সিলেট" },
      { key: "ময়মনসিংহ", value: "ময়মনসিংহ" }
    ]
  },
  {
    id: 'district',
    label: "জেলা*",
    placeholder: "জেলা সিলেক্ট করুন",
    type: "sub-select",
    items: {
      বরিশাল: [
        { key: "বরিশাল", value: "বরিশাল" },
        { key: "ভোলা", value: "ভোলা" },
        { key: "ঝালকাঠি", value: "ঝালকাঠি" },
        { key: "পটুয়াখালী", value: "পটুয়াখালী" },
        { key: "পিরোজপুর", value: "পিরোজপুর" },
        { key: "বরগুনা", value: "বরগুনা" }
      ],
      ঢাকা: [
        { key: "ঢাকা", value: "ঢাকা" },
        { key: "ফরিদপুর", value: "ফরিদপুর" },
        { key: "গাজীপুর", value: "গাজীপুর" },
        { key: "গোপালগঞ্জ", value: "গোপালগঞ্জ" },
        { key: "কিশোরগঞ্জ", value: "কিশোরগঞ্জ" },
        { key: "মাদারীপুর", value: "মাদারীপুর" },
        { key: "মানিকগঞ্জ", value: "মানিকগঞ্জ" },
        { key: "মুন্সিগঞ্জ", value: "মুন্সিগঞ্জ" },
        { key: "নারায়ণগঞ্জ", value: "নারায়ণগঞ্জ" },
        { key: "নরসিংদী", value: "নরসিংদী" },
        { key: "রাজবাড়ী", value: "রাজবাড়ী" },
        { key: "শরীয়তপুর", value: "শরীয়তপুর" },
        { key: "টাঙ্গাইল", value: "টাঙ্গাইল" }
      ],
      চট্টগ্রাম: [
        { key: "চট্টগ্রাম", value: "চট্টগ্রাম" },
        { key: "বান্দরবান", value: "বান্দরবান" },
        { key: "ব্রাহ্মণবাড়িয়া", value: "ব্রাহ্মণবাড়িয়া" },
        { key: "চাঁদপুর", value: "চাঁদপুর" },
        { key: "কক্সবাজার", value: "কক্সবাজার" },
        { key: "ফেনী", value: "ফেনী" },
        { key: "খাগড়াছড়ি", value: "খাগড়াছড়ি" },
        { key: "লক্ষ্মীপুর", value: "লক্ষ্মীপুর" },
        { key: "নোয়াখালী", value: "নোয়াখালী" },
        { key: "রাঙ্গামাটি", value: "রাঙ্গামাটি" }
      ],
      খুলনা: [
        { key: "খুলনা", value: "খুলনা" },
        { key: "বাগেরহাট", value: "বাগেরহাট" },
        { key: "চুয়াডাঙ্গা", value: "চুয়াডাঙ্গা" },
        { key: "যশোর", value: "যশোর" },
        { key: "জয়পুরহাট", value: "জয়পুরহাট" },
        { key: "মেহেরপুর", value: "মেহেরপুর" },
        { key: "নড়াইল", value: "নড়াইল" },
        { key: "সাতক্ষীরা", value: "সাতক্ষীরা" }
      ],
      রাজশাহী: [
        { key: "রাজশাহী", value: "রাজশাহী" },
        { key: "বগুড়া", value: "বগুড়া" },
        { key: "জয়পুরহাট", value: "জয়পুরহাট" },
        { key: "নাটোর", value: "নাটোর" },
        { key: "নওগাঁ", value: "নওগাঁ" },
        { key: "পাবনা", value: "পাবনা" },
        { key: "রাজশাহী", value: "রাজশাহী" },
        { key: "সিরাজগঞ্জ", value: "সিরাজগঞ্জ" }
      ],
      রংপুর: [
        { key: "দিনাজপুর", value: "দিনাজপুর" },
        { key: "গাইবান্ধা", value: "গাইবান্ধা" },
        { key: "কুড়িগ্রাম", value: "কুড়িগ্রাম" },
        { key: "লালমনিরহাট", value: "লালমনিরহাট" },
        { key: "নীলফামারী", value: "নীলফামারী" },
        { key: "পাঁচগড়", value: "পাঁচগড়" },
        { key: "রংপুর", value: "রংপুর" },
        { key: "ঠাকুরগাঁও", value: "ঠাকুরগাঁও" }
      ],
      সিলেট: [
        { key: "সিলেট", value: "সিলেট" },
        { key: "হবিগঞ্জ", value: "হবিগঞ্জ" },
        { key: "মৌলভীবাজার", value: "মৌলভীবাজার" },
        { key: "সুনামগঞ্জ", value: "সুনামগঞ্জ" }
      ],
      ময়মনসিংহ: [
        { key: "ময়মনসিংহ", value: "ময়মনসিংহ" },
        { key: "জামালপুর", value: "জামালপুর" },
        { key: "নেত্রকোণা", value: "নেত্রকোণা" },
        { key: "শেরপুর", value: "শেরপুর" }
      ]
    }
  },
  {
    id: "address",
    label: "বিস্তারিত ঠিকানা*",
    placeholder: "আপনার বিস্তারিত ঠিকানা",
  },
  // {
  //   id: 6,
  //   label: "তথ্য গুলো সেভ করুন",
  //   type: "checkbox",
  // },
];


export const addressInput = [
    {
      id: 0,
      label: "বিভাগ*",
      placeholder: "বিভাগ সিলেক্ট করুন",
      type: "select",
      items: [
        { key: "বরিশাল", value: "বরিশাল" },
        { key: "ঢাকা", value: "ঢাকা" },
        { key: "চট্টগ্রাম", value: "চট্টগ্রাম" },
        { key: "খুলনা", value: "খুলনা" },
        { key: "রাজশাহী", value: "রাজশাহী" },
        { key: "রংপুর", value: "রংপুর" },
        { key: "সিলেট", value: "সিলেট" },
        { key: "ময়মনসিংহ", value: "ময়মনসিংহ" }
      ]
    },
    {
      id: 1,
      label: "জেলা*",
      placeholder: "জেলা সিলেক্ট করুন",
      type: "sub-select",
      items: {
        বরিশাল: [
          { key: "বরিশাল", value: "বরিশাল" },
          { key: "ভোলা", value: "ভোলা" },
          { key: "ঝালকাঠি", value: "ঝালকাঠি" },
          { key: "পটুয়াখালী", value: "পটুয়াখালী" },
          { key: "পিরোজপুর", value: "পিরোজপুর" },
          { key: "বরগুনা", value: "বরগুনা" }
        ],
        ঢাকা: [
          { key: "ঢাকা", value: "ঢাকা" },
          { key: "ফরিদপুর", value: "ফরিদপুর" },
          { key: "গাজীপুর", value: "গাজীপুর" },
          { key: "গোপালগঞ্জ", value: "গোপালগঞ্জ" },
          { key: "কিশোরগঞ্জ", value: "কিশোরগঞ্জ" },
          { key: "মাদারীপুর", value: "মাদারীপুর" },
          { key: "মানিকগঞ্জ", value: "মানিকগঞ্জ" },
          { key: "মুন্সিগঞ্জ", value: "মুন্সিগঞ্জ" },
          { key: "নারায়ণগঞ্জ", value: "নারায়ণগঞ্জ" },
          { key: "নরসিংদী", value: "নরসিংদী" },
          { key: "রাজবাড়ী", value: "রাজবাড়ী" },
          { key: "শরীয়তপুর", value: "শরীয়তপুর" },
          { key: "টাঙ্গাইল", value: "টাঙ্গাইল" }
        ],
        চট্টগ্রাম: [
          { key: "চট্টগ্রাম", value: "চট্টগ্রাম" },
          { key: "বান্দরবান", value: "বান্দরবান" },
          { key: "ব্রাহ্মণবাড়িয়া", value: "ব্রাহ্মণবাড়িয়া" },
          { key: "চাঁদপুর", value: "চাঁদপুর" },
          { key: "কক্সবাজার", value: "কক্সবাজার" },
          { key: "ফেনী", value: "ফেনী" },
          { key: "খাগড়াছড়ি", value: "খাগড়াছড়ি" },
          { key: "লক্ষ্মীপুর", value: "লক্ষ্মীপুর" },
          { key: "নোয়াখালী", value: "নোয়াখালী" },
          { key: "রাঙ্গামাটি", value: "রাঙ্গামাটি" }
        ],
        খুলনা: [
          { key: "খুলনা", value: "খুলনা" },
          { key: "বাগেরহাট", value: "বাগেরহাট" },
          { key: "চুয়াডাঙ্গা", value: "চুয়াডাঙ্গা" },
          { key: "যশোর", value: "যশোর" },
          { key: "জয়পুরহাট", value: "জয়পুরহাট" },
          { key: "মেহেরপুর", value: "মেহেরপুর" },
          { key: "নড়াইল", value: "নড়াইল" },
          { key: "সাতক্ষীরা", value: "সাতক্ষীরা" }
        ],
        রাজশাহী: [
          { key: "রাজশাহী", value: "রাজশাহী" },
          { key: "বগুড়া", value: "বগুড়া" },
          { key: "জয়পুরহাট", value: "জয়পুরহাট" },
          { key: "নাটোর", value: "নাটোর" },
          { key: "নওগাঁ", value: "নওগাঁ" },
          { key: "পাবনা", value: "পাবনা" },
          { key: "রাজশাহী", value: "রাজশাহী" },
          { key: "সিরাজগঞ্জ", value: "সিরাজগঞ্জ" }
        ],
        রংপুর: [
          { key: "দিনাজপুর", value: "দিনাজপুর" },
          { key: "গাইবান্ধা", value: "গাইবান্ধা" },
          { key: "কুড়িগ্রাম", value: "কুড়িগ্রাম" },
          { key: "লালমনিরহাট", value: "লালমনিরহাট" },
          { key: "নীলফামারী", value: "নীলফামারী" },
          { key: "পাঁচগড়", value: "পাঁচগড়" },
          { key: "রংপুর", value: "রংপুর" },
          { key: "ঠাকুরগাঁও", value: "ঠাকুরগাঁও" }
        ],
        সিলেট: [
          { key: "সিলেট", value: "সিলেট" },
          { key: "হবিগঞ্জ", value: "হবিগঞ্জ" },
          { key: "মৌলভীবাজার", value: "মৌলভীবাজার" },
          { key: "সুনামগঞ্জ", value: "সুনামগঞ্জ" }
        ],
        ময়মনসিংহ: [
          { key: "ময়মনসিংহ", value: "ময়মনসিংহ" },
          { key: "জামালপুর", value: "জামালপুর" },
          { key: "নেত্রকোণা", value: "নেত্রকোণা" },
          { key: "শেরপুর", value: "শেরপুর" }
        ]
      }
    }
  ]
   